In [1]:
import pandas as pd

In [2]:
name = ["Mike", "Calros", "Ohthon"]
job = ["Plumber", "Consultant", "Doctor"]
inc = [300, 1000, 1500]

In [3]:
data = pd.DataFrame({"name": name, "job": job, "inc": inc})
data

     name         job   inc
0    Mike     Plumber   300
1  Calros  Consultant  1000
2  Ohthon      Doctor  1500

In [4]:
li = ["a", "b", "c"]
li

['a', 'b', 'c']

In [5]:
data == li

/Users/ozawaatsushi/anaconda3/lib/python3.7/site-packages/pandas/core/ops.py:1649: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

    name    job    inc
0  False  False  False
1  False  False  False
2  False  False  False

In [6]:
li = ["Mike", "Calros", "Ohthon"]
li

['Mike', 'Calros', 'Ohthon']

In [7]:
data == li

    name    job    inc
0   True  False  False
1  False  False  False
2  False  False  False

In [10]:
li = ["Mike", "Plumber", 300]
li

['Mike', 'Plumber', 300]

In [11]:
data == li

    name    job    inc
0   True   True   True
1  False  False  False
2  False  False  False